<?php

return [
    'profile' => 'Профиль',
    'profile-info' => 'Информация профиля',
    'description-info' => "Обновите информацию профиля и адрес электронной почты вашего аккаунта.",
    'avatar' => 'Аватар',
    'name' => 'Имя',
    'email' => 'Электронная почта',
    'about' => 'О себе',
    'about-placeholder' => 'Расскажите о себе...',
    'location' => 'Местоположение',
    'experience' => 'Опыт',
    'experience-placeholder' => 'Расскажите о своем опыте...',
    'github-link' => 'Ссылка на Github',
    'your-skills' => 'Ваши навыки',
    'seeking-skills' => 'Ищу навыки',
    'your-skills-placeholder' => 'Выберите ваши навыки...',
    'seeking-skills-placeholder' => 'Выберите навыки, которые вы ищете...',
    'save' => 'Сохранить',

    'update-password' => 'Обновить пароль',
    'password-info' => 'Убедитесь, что ваш аккаунт использует длинный, случайный пароль для обеспечения безопасности.',
    'current-password' => 'Текущий пароль',
    'new-password' => 'Новый пароль',
    'confirm-password' => 'Подтвердите пароль',

    'delete-account' => 'Удалить аккаунт',
    'delete-account-info' => 'После удаления вашего аккаунта все его ресурсы и данные будут безвозвратно удалены. Перед удалением аккаунта, пожалуйста, скачайте все данные или информацию, которую вы хотите сохранить.',
    'delete-account-confirm' => 'Вы уверены, что хотите удалить свой аккаунт?',
    'delete-account-confirm-info' => 'После удаления вашего аккаунта все его ресурсы и данные будут безвозвратно удалены. Пожалуйста, введите свой пароль, чтобы подтвердить, что вы хотите безвозвратно удалить свой аккаунт.',
    'delete-account-password' => 'Пароль',

    'cancel' => 'Отмена',
    'delete' => 'Удалить аккаунт',
];
